def category (k):
    match k: 
        case (1):
            return "Весь ассортимент категории \"Женская обувь\" вы можете посмотреть здесь https://t.me/+NeBI0G73S9U3ODgy"
        case (2):
            return "Весь ассортимент категории \"Мужская обувь\" вы можете посмотреть здесь https://t.me/+GWlhY5TWsdlmODIy"
        case (3):
            return "Весь ассортимент категории \"Детская обувь\" вы можете посмотреть здесь https://t.me/+dsCtb4c01-k0ZjIy"
        case (4):
            return "Весь ассортимент категории \"Кофты и водолазки\" вы можете посмотреть здесь https://t.me/+NceQ9NgIKO85YzAy"
        case (5):
            return "Весь ассортимент категории \"Футболки и рубашки (упаковками)\" вы можете посмотреть здесь https://t.me/+QMghac2iSm5kYmJi"
        case (6):
            return "Весь ассортимент категории \"Футболки и топы (штучно)\" вы можете посмотреть здесь https://t.me/+XO0H-HonUCgxMDNi"
        case (7):
            return "Весь ассортимент категории \"Одежда единого размера (штучно)\" вы можете посмотреть здесь https://t.me/+xE7ojKEx_BszMzg6"
        case (8):
            return "Весь ассортимент категории \"Верхняя одежда\" вы можете посмотреть здесь https://t.me/+oHdMeZSLzQs5NTQ6"
        case (9):
            return "Весь ассортимент категории \"Женские костюмы\" вы можете посмотреть здесь https://t.me/+QZua3ZEzur43ODRi"
        case (10):
            return "Весь ассортимент категории \"Женские костюмы классика\" вы можете посмотреть здесь https://t.me/+K-yzWxq0QHtlOWIy"
        case (11):
            return "Весь ассортимент категории \"Платья\" вы можете посмотреть здесь https://t.me/+K-yzWxq0QHtlOWIy"
        case (12):
            return "Весь ассортимент категории \"Пиджаки\" вы можете посмотреть здесь https://t.me/+L-FnZ3xu07FjOWQy"
        case (13):
            return "Весь ассортимент категории \"Юбки и шорты\" вы можете посмотреть здесь https://t.me/+0I9uzqAnUFdkODU6"
        case (14):
            return "Весь ассортимент категории \"Штаны и джинсы\" вы можете посмотреть здесь https://t.me/+GqXzNcu-DYUzODg6"
        case (15):
            return "Весь ассортимент категории \"Большие размеры\" вы можете посмотреть здесь https://t.me/+iYoQnHsusigzYmIy"
        case (16):
            return "Весь ассортимент категории \"Нижнее бельё\" вы можете посмотреть здесь https://t.me/+um5xV_6uRoBlYzNi"
        case (17):
            return "Весь ассортимент категории \"Пижамы\" вы можете посмотреть здесь https://t.me/+PJ13tgOsBFMxMmIy"
        case (18):
            return "Весь ассортимент категории \"Головные уборы\" вы можете посмотреть здесь https://t.me/+i9nxX7oIYYc2MWZi"
        case (19):
            return "Весь ассортимент категории \"Платки и шарфы\" вы можете посмотреть здесь https://t.me/+o3jxIZcJZMZmNTgy"
        case (20):
            return "Весь ассортимент категории \"Носки и колготки\" вы можете посмотреть здесь https://t.me/+qFzw_ir0SdJmN2Ji"
        case (21):
            return "Весь ассортимент категории \"Спорт и фитнес\" вы можете посмотреть здесь https://t.me/+yt-m7q2X8gdiNzQy"
        case (22):
            return "Весь ассортимент категории \"Купальники\" вы можете посмотреть здесь https://t.me/+73T5lMg_fZ42N2Ey"
        case (23):
            return "Весь ассортимент категории \"Ремни\" вы можете посмотреть здесь https://t.me/+9azbNO2sHeUzYjUy"
        case (24):
            return "Весь ассортимент категории \"Сумки\" вы можете посмотреть здесь https://t.me/+tPve97sJ6YE3MzY6"
        case (25):
            return "Весь ассортимент категории \"Очки\" вы можете посмотреть здесь https://t.me/+sGXrwwt-fxdhNTJi"
        case (26):
            return "Весь ассортимент категории \"Бижутерия\" вы можете посмотреть здесь https://t.me/+qDtlGjtw0Q04OGZi"

def category_ch (k):
    match k: 
        case (1):
            return "\"Женская обувь\""
        case (2):
            return "\"Мужская обувь\""
        case (3):
            return "\"Детская обувь\""
        case (4):
            return "\"Кофты и водолазки\""
        case (5):
            return "\"Футболки и рубашки (упаковками)\""
        case (6):
            return "\"Футболки и топы (штучно)\""
        case (7):
            return "\"Одежда единого размера (штучно)\""
        case (8):
            return "\"Верхняя одежда\""
        case (9):
            return "\"Женские костюмы\""
        case (10):
            return "\"Женские костюмы классика\""
        case (11):
            return "\"Платья\""
        case (12):
            return "\"Пиджаки\""
        case (13):
            return "\"Юбки и шорты\""
        case (14):
            return "\"Штаны и джинсы\""
        case (15):
            return "\"Большие размеры\""
        case (16):
            return "\"Нижнее бельё\""
        case (17):
            return "\"Пижамы\""
        case (18):
            return "\"Головные уборы\""
        case (19):
            return "\"Платки и шарфы\""
        case (20):
            return "\"Носки и колготки\""
        case (21):
            return "\"Спорт и фитнес\""
        case (22):
            return "\"Купальники\""
        case (23):
            return "\"Ремни\""
        case (24):
            return "\"Сумки\""
        case (25):
            return "\"Очки\""
        case (26):
            return "\"Бижутерия\""
